zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32ck_sg_gc/pic32ck_gc00/pic32ck1025gc00100-pinctrl.h
#define PC11D_SERCOM2_PAD0 MCHP_PINMUX(c, 11, d, periph)

#define PC11G_TCC1_WO6 MCHP_PINMUX(c, 11, g, periph)

#define PC11M_CCL_IN4 MCHP_PINMUX(c, 11, m, periph)

#define PC11N_PTC_DRV21 MCHP_PINMUX(c, 11, n, periph)

#define PC12_GPIO MCHP_PINMUX(c, 12, gpio, gpio)

#define PC12A_EIC_EXTINT12 MCHP_PINMUX(c, 12, a, periph)

#define PC12C_SERCOM0_PAD2 MCHP_PINMUX(c, 12, c, periph)

#define PC12D_SERCOM2_PAD2 MCHP_PINMUX(c, 12, d, periph)

#define PC12G_TCC1_WO7 MCHP_PINMUX(c, 12, g, periph)

#define PC12M_CCL_IN5 MCHP_PINMUX(c, 12, m, periph)

#define PC12N_PTC_DRV22 MCHP_PINMUX(c, 12, n, periph)

#define PC13_GPIO MCHP_PINMUX(c, 13, gpio, gpio)

#define PC13A_EIC_EXTINT13 MCHP_PINMUX(c, 13, a, periph)

#define PC13C_SERCOM0_PAD3 MCHP_PINMUX(c, 13, c, periph)

#define PC13D_SERCOM2_PAD3 MCHP_PINMUX(c, 13, d, periph)

#define PC13M_CCL_OUT1 MCHP_PINMUX(c, 13, m, periph)

#define PC13N_PTC_DRV18 MCHP_PINMUX(c, 13, n, periph)

#define PC14_GPIO MCHP_PINMUX(c, 14, gpio, gpio)

#define PC14A_EIC_EXTINT14 MCHP_PINMUX(c, 14, a, periph)

#define PC14C_SERCOM2_PAD2 MCHP_PINMUX(c, 14, c, periph)

#define PC14E_EBI_A8 MCHP_PINMUX(c, 14, e, periph)

#define PC14K_PCC_DEN2 MCHP_PINMUX(c, 14, k, periph)

#define PC14N_PTC_DRV26 MCHP_PINMUX(c, 14, n, periph)

#define PC15_GPIO MCHP_PINMUX(c, 15, gpio, gpio)

#define PC15A_EIC_EXTINT15 MCHP_PINMUX(c, 15, a, periph)

#define PC15C_SERCOM2_PAD0 MCHP_PINMUX(c, 15, c, periph)

#define PC15D_SERCOM3_PAD3 MCHP_PINMUX(c, 15, d, periph)

#define PC15E_EBI_A6 MCHP_PINMUX(c, 15, e, periph)

#define PC15F_TCC1_WO0 MCHP_PINMUX(c, 15, f, periph)

#define PC15G_TCC1_WO4 MCHP_PINMUX(c, 15, g, periph)

#define PC15K_PCC_DATA8 MCHP_PINMUX(c, 15, k, periph)

#define PC15M_AC_CMP1 MCHP_PINMUX(c, 15, m, periph)

#define PC15N_PTC_DRV27 MCHP_PINMUX(c, 15, n, periph)

#define PC16_GPIO MCHP_PINMUX(c, 16, gpio, gpio)

#define PC16A_EIC_EXTINT0 MCHP_PINMUX(c, 16, a, periph)

#define PC16C_SERCOM2_PAD1 MCHP_PINMUX(c, 16, c, periph)

#define PC16E_EBI_A5 MCHP_PINMUX(c, 16, e, periph)

#define PC16F_TCC1_WO1 MCHP_PINMUX(c, 16, f, periph)

#define PC16K_PCC_DATA9 MCHP_PINMUX(c, 16, k, periph)

#define PC16N_PTC_DRV28 MCHP_PINMUX(c, 16, n, periph)

#define PC17_GPIO MCHP_PINMUX(c, 17, gpio, gpio)

#define PC17A_EIC_EXTINT1 MCHP_PINMUX(c, 17, a, periph)

#define PC17C_SERCOM2_PAD2 MCHP_PINMUX(c, 17, c, periph)

#define PC17E_EBI_A4 MCHP_PINMUX(c, 17, e, periph)

#define PC17F_TCC1_WO2 MCHP_PINMUX(c, 17, f, periph)

#define PC17K_PCC_DATA10 MCHP_PINMUX(c, 17, k, periph)

#define PC17N_PTC_DRV29 MCHP_PINMUX(c, 17, n, periph)

#define PC18_GPIO MCHP_PINMUX(c, 18, gpio, gpio)

#define PC18A_EIC_EXTINT2 MCHP_PINMUX(c, 18, a, periph)

#define PC18C_SERCOM2_PAD3 MCHP_PINMUX(c, 18, c, periph)

#define PC18E_EBI_A3 MCHP_PINMUX(c, 18, e, periph)

#define PC18F_TCC1_WO3 MCHP_PINMUX(c, 18, f, periph)

#define PC18K_PCC_DATA11 MCHP_PINMUX(c, 18, k, periph)

#define PC18N_PTC_DRV30 MCHP_PINMUX(c, 18, n, periph)

#define PC19_GPIO MCHP_PINMUX(c, 19, gpio, gpio)

#define PC19A_EIC_EXTINT3 MCHP_PINMUX(c, 19, a, periph)

#define PC19E_EBI_A2 MCHP_PINMUX(c, 19, e, periph)

#define PC19F_TCC1_WO4 MCHP_PINMUX(c, 19, f, periph)

#define PC19K_PCC_DATA12 MCHP_PINMUX(c, 19, k, periph)

#define PC19N_PTC_DRV31 MCHP_PINMUX(c, 19, n, periph)

#define PC20_GPIO MCHP_PINMUX(c, 20, gpio, gpio)

#define PC20A_EIC_EXTINT4 MCHP_PINMUX(c, 20, a, periph)

#define PC20E_EBI_NBS2_NWR2_A1 MCHP_PINMUX(c, 20, e, periph)

#define PC20F_TCC1_WO5 MCHP_PINMUX(c, 20, f, periph)

#define PC20K_PCC_DATA13 MCHP_PINMUX(c, 20, k, periph)

#define PC20N_PTC_DRV23 MCHP_PINMUX(c, 20, n, periph)

#define PD0_GPIO MCHP_PINMUX(d, 0, gpio, gpio)

#define PD0A_EIC_EXTINT0 MCHP_PINMUX(d, 0, a, periph)

#define PD1_GPIO MCHP_PINMUX(d, 1, gpio, gpio)

#define PD1A_EIC_EXTINT1 MCHP_PINMUX(d, 1, a, periph)

#define PD2_GPIO MCHP_PINMUX(d, 2, gpio, gpio)

#define PD2A_EIC_NMI MCHP_PINMUX(d, 2, a, periph)

#define PD2E_EBI_A19 MCHP_PINMUX(d, 2, e, periph)

#define PD2H_USB_SOF_1KHZ MCHP_PINMUX(d, 2, h, periph)

#define PD2K_PCC_DEN2 MCHP_PINMUX(d, 2, k, periph)

#define PD3_GPIO MCHP_PINMUX(d, 3, gpio, gpio)

#define PD3A_EIC_EXTINT3 MCHP_PINMUX(d, 3, a, periph)

#define PD3H_USB_DM MCHP_PINMUX(d, 3, h, periph)

#define PD4_GPIO MCHP_PINMUX(d, 4, gpio, gpio)

#define PD4A_EIC_EXTINT4 MCHP_PINMUX(d, 4, a, periph)

#define PD4H_USB_DP MCHP_PINMUX(d, 4, h, periph)

#define PD5_GPIO MCHP_PINMUX(d, 5, gpio, gpio)

#define PD5A_EIC_EXTINT5 MCHP_PINMUX(d, 5, a, periph)

#define PD5C_SERCOM0_PAD2 MCHP_PINMUX(d, 5, c, periph)

#define PD5E_EBI_NWE_NWR0 MCHP_PINMUX(d, 5, e, periph)

#define PD5G_TCC2_WO0 MCHP_PINMUX(d, 5, g, periph)

#define PD5H_SQI_CS1 MCHP_PINMUX(d, 5, h, periph)

#define PD5I_SDMMC0_SDWP MCHP_PINMUX(d, 5, i, periph)

#define PD5M_GCLK_IO3 MCHP_PINMUX(d, 5, m, periph)

#define PD6_GPIO MCHP_PINMUX(d, 6, gpio, gpio)

#define PD6A_EIC_EXTINT6 MCHP_PINMUX(d, 6, a, periph)

#define PD6C_SERCOM0_PAD0 MCHP_PINMUX(d, 6, c, periph)

#define PD6E_EBI_A18 MCHP_PINMUX(d, 6, e, periph)

#define PD6F_TCC2_WO4 MCHP_PINMUX(d, 6, f, periph)

#define PD6G_TCC2_WO1 MCHP_PINMUX(d, 6, g, periph)

#define PD6H_SQI_CS0 MCHP_PINMUX(d, 6, h, periph)

#define PD6I_SDMMC0_SDCMD MCHP_PINMUX(d, 6, i, periph)

#define PD6J_SPI_IXS_FSYNC MCHP_PINMUX(d, 6, j, periph)

#define PD6M_GCLK_IO4 MCHP_PINMUX(d, 6, m, periph)

#define PD7_GPIO MCHP_PINMUX(d, 7, gpio, gpio)

#define PD7A_EIC_EXTINT7 MCHP_PINMUX(d, 7, a, periph)

#define PD7C_SERCOM0_PAD1 MCHP_PINMUX(d, 7, c, periph)

#define PD7E_EBI_A17 MCHP_PINMUX(d, 7, e, periph)

#define PD7F_TCC2_WO5 MCHP_PINMUX(d, 7, f, periph)

#define PD7G_TCC2_WO2 MCHP_PINMUX(d, 7, g, periph)

#define PD7H_SQI_DATA0 MCHP_PINMUX(d, 7, h, periph)

#define PD7I_SDMMC0_SDDAT0 MCHP_PINMUX(d, 7, i, periph)

#define PD7J_SPI_IXS_SDI MCHP_PINMUX(d, 7, j, periph)

#define PD7M_GCLK_IO5 MCHP_PINMUX(d, 7, m, periph)

#define PD8_GPIO MCHP_PINMUX(d, 8, gpio, gpio)

#define PD8A_EIC_EXTINT8 MCHP_PINMUX(d, 8, a, periph)

#define PD8C_SERCOM1_PAD0 MCHP_PINMUX(d, 8, c, periph)

#define PD8E_EBI_A16 MCHP_PINMUX(d, 8, e, periph)

#define PD8G_TCC2_WO3 MCHP_PINMUX(d, 8, g, periph)

#define PD8H_SQI_DATA2 MCHP_PINMUX(d, 8, h, periph)

#define PD8I_SDMMC0_SDDAT2 MCHP_PINMUX(d, 8, i, periph)

#define PD8J_SPI_IXS_SDO MCHP_PINMUX(d, 8, j, periph)

#define PD8M_CCL_IN6 MCHP_PINMUX(d, 8, m, periph)

#define PD9_GPIO MCHP_PINMUX(d, 9, gpio, gpio)

